# RoofComponents Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoofComponents Methods
RoofComponents Class See Also
---
The RoofComponents type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAreasOfCurveLoops | The areas of CurveLoops of roof slabs. |
| GetCurveLoops | The CurveLoops of roof slabs. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLoopFaces | The faces of the loops of roof slabs. |
| GetPlaneDirections | The plane directions of roof slabs. |
| GetPlaneOrigins | The plane origins of roof slabs. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace